# Задача 1 Вывод линии из символов
a = int(input("Введите колличество символов в стоке: "))
b = input("Введите желаемый символ: ")
c = int(input("Расположение линии\n 1 - Горизонтально\n 2 - вертикально:\n Задайте расположение линии: "))
i = 0

print("Выводим результат: \n", end="")
if c == 1:
      print(b*a)
if c == 2:
      while i < a:
            print(b)
            a -= 1


# Задача 2 вывести прямоугольник из чередующихся символов

a = b = int(input("Введите ширину прямоугольника: "))
i = 0

while i < b/2:
      print("+" * a)
      print("-" * a)
      i += 1




# задача №3 "Нахождение максимального числа"

a = int(input("введите число a: "))
b = int(input("введите число b: "))
c = int(input("введите число c: "))

print("Максимальное число: ", end="")
print (a if a > b > c else b if b > c else c )



# Задача №4 "Калькулятор"
print("Операторы\n"
      "1 " "r" "-унарный минус\n"
      "2 ""+" "сложение\n"
      "3 ""-" "вычитание\n"
      "4 ""/" "деление\n"
      "5 ""*" "умножение\n"
      "6 ""%" "остаток от деления\n"
      "7 ""<"">" "сравнение\n")

oper = int(input("Введите цифру номера операции: "))
a = int(input("Введите первое число: "))
z = int(input("Введите второе число: "))
n = 0
#
# print("Результат операции: ", end="")
# print(a+z if oper == 2 else a-z if oper == 3 else a*z if oper == 5 else"")
# print(a/z if oper == 4 and z != 0 else "На ноль делить нельзя " if z == 0 else "")
# print(a > z if oper == 7 and a > z else z > a if z > a else "")
print("Итог операции ", end=" ")
if oper == 1:
      print("Совсем не понял, что тут должно произойти")
if oper == 2:
      print("сложение = ", a+z)
if oper == 3:
      print("вычитание = ", a-z)
if oper == 4:
      if z == 0:
            print("На ноль делить нельзя")
      else:
            print("деление = ", a / z)
if oper == 5:
      print("умножение = ", a * z)
if oper == 6:
      print("остаток от деления = ", a % z)
if oper == 7:
      if a > z:
            print("сравнение : ", a, ">", z)
      if a < z:
            print("сравнение : ", a, "<", z)
      if a == z:
            print("сравнение : ", a, "=", z)







